package lab3;

/*
14 Написать секундомер – класс Stopwatch – для замера времени в отдельном потоке выполнения. В классе должны быть реализованы следующие методы:
- start – начинает отсчет времени;
- stop – прерывает отсчет времени;
- reset – сбрасывает текущее значение секундомера;
- getTime – возвращает отсчитанное время в миллисекундах.
Для демонстрации работы секундомера написать консольное приложение.


Пользователю должны быть доступными следующие команды:
- start N – запустить секундомер и дать ему идентификатор N;
- stop N – остановить секундомер с идентификатором N;
- reset N – сбросить время у секундомера с идентификатором N;
- time N – показать время у секундомера с идентификатором N;
- help – список команд;
- exit – выход.
 */


/*
1 Дайте определение понятию «процесс».
2 Дайте определение понятию «поток».
3 Дайте определение понятию «синхронизация потоков».
4 Как взаимодействуют программы, процессы и потоки?
5 В каких случаях целесообразно создавать несколько потоков?
6 Что может произойти, если два потока будут выполнять один и тот же
код в программе?
7 Что вы знаете о главном потоке программы?
8 Какие есть способы создания и запуска потоков?
32
9 Какой метод запускает поток на выполнение?
10 Какой метод описывает действие потока во время выполнения?
11 Когда поток завершает свое выполнение?
 */
public class Main {
    public static void main(String[] args) {
        StopwatchManager swm = new StopwatchManager();
        swm.start();
    }
}
