package lab3;

/*
14 Написать секундомер – класс Stopwatch – для замера времени в отдельном потоке выполнения. В классе должны быть реализованы следующие методы:
- start – начинает отсчет времени;
- stop – прерывает отсчет времени;
- reset – сбрасывает текущее значение секундомера;
- getTime – возвращает отсчитанное время в миллисекундах.
Для демонстрации работы секундомера написать консольное приложение.


Пользователю должны быть доступными следующие команды:
- start N – запустить секундомер и дать ему идентификатор N;
- stop N – остановить секундомер с идентификатором N;
- reset N – сбросить время у секундомера с идентификатором N;
- time N – показать время у секундомера с идентификатором N;
- help – список команд;
- exit – выход.

 */
public class Main {
    public static void main(String[] args) {
        StopwatchManager swm = new StopwatchManager();
        swm.start();
    }
}
